[{"content":"Welcome! We are still adding materials. Select a chapter from the menu on the left.\n","date":1508426775,"description":"Home page","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/","publishdate":"2018-11-23T15:26:15Z","title":"Home"},{"content":"This site contains a collection of lectures, assignments, and instructor materials for teaching software engineering or development, at an intermediate level. It is assumed that students already know basic software engineering terms and skills.\nMaterials are used for the ITEC 3870 Software Development II course taught at Georgia Gwinnett College . They were developed by Cengiz Gunay and Anca Doloc-Mihu , supported by an Affordable Learning Georgia grant in 2019-2020.\nSome materials are courtesy of Joan Smith, Eugene Agichstein, and the Internets. Slides are offered with the license: CC BY-SA 4.0 .\nTo modify and use these materials in your classes, fork the Github repository or use the edit link at the bottom right of each page.\n","date":1508426775,"description":"About this Site","lastmod":"2019-10-26T15:26:15Z","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/about/","publishdate":"2018-11-23T15:26:15Z","title":"About this Site"},{"content":"Select a chapter from the menu.\n","date":1603121175,"description":"Instructor Materials","lastmod":"2020-12-20T15:26:15Z","objectID":"9e6a1416d4bf7d2fcfc2765ce90e972f","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/","publishdate":"2019-11-23T15:26:15Z","title":"Instructor Materials"},{"content":"This section includes all the small assignments for the course.\nAssignments are marked as individual or team to clarify for students what type of submission is expected.\nEach assignment includes two parts:\n  Instructor Instructions: Includes suggestions for setting up the particular assignment (like, time-wise, platform,etc).\n  Posting for Students: The text can posted to students.\n  Some assignments are split into several mini-assignments such that each mini-assignment can be assigned at its own deadline. However, in the grade book all parts are summed up into one assignment, for example \u0026amp;lsquo;grade of Assgn 1a\u0026amp;rsquo; + \u0026amp;lsquo;grade of Assgn 1b\u0026amp;rsquo; + \u0026amp;lsquo;grade of Assgn 1c\u0026amp;rsquo; = \u0026amp;lsquo;grade of Assgn 1\u0026amp;rsquo;\n","date":1603121175,"description":"Assignments","lastmod":"2020-12-20T15:26:15Z","objectID":"a94b5e3a08c53965757cf6617c2bd9f4","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/","publishdate":"2019-11-23T15:26:15Z","title":"Assignments"},{"content":"Assgn 1a (individual): Class Introductions Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them know their teammates and their working times. Suggested time: 3-5 days  Posting for Students:\nPost a quick resume here\nIn your resume, include:\n Your photo/selfie Your name (also indicate preferred name) Concentration/year Previous courses (optionally grades) Skills (computer languages, platforms, etc) Interests (keep it relevant) Expertise in software development tools (IDEs, version control, build tools, etc) Past software projects (briefly explain the scope and your role) Work hours and availability (will help to form teams with similar students)  We will use this information for picking teams and project roles.\n","date":1603121175,"description":"Assgn 1a","lastmod":"2020-12-20T15:26:15Z","objectID":"c5967a23007dd70a42a4a21cb20803b4","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn1a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 1a"},{"content":"Assgn 1b (individual): Accounts set up Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help students and instructor throughout the semester. Suggested time: 3-5 days Instructor needs to post here the links to the Discord channel, Piazza class, Jira server (we do not include these here since they are private domains only for the course students).  Posting for Students:\nSet up your accounts\nThis semester we will use several tools for communicating and version control that are commonly used in the industry. As software developers, you need to get familiarized with these tools.\nPost a followup below with your accounts on:\n  Discord\n  Github\n  Jira (later)\n  Links for these can be found here (post).\nWe will be using Github organization \u0026amp;ldquo;GGC-SD\u0026amp;rdquo;. Post your Github account here so we can add you to it. Use the \u0026amp;ldquo;followup discussions\u0026amp;rdquo; so we know who you are.\nWe are using Discord for fast communication. Post your Discord nickname/ID so I can add you to our server.\n","date":1603121175,"description":"Assgn 1b","lastmod":"2020-12-20T15:26:15Z","objectID":"fc90df49771d31743e90148da76e6005","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn1b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 1b"},{"content":"Assgn 1c (individual): Soft Dev Articles Discussion Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them see different points of view. Suggested time: 7 days  Posting for Students:\nPost essay about articles\nRead the following articles. Post your point of view on each topic.\nNext class, we will have a class discussion on Software Development vs Software Engineering.\nArticles:\n  Software Development versus Software Engineering   Dr Dobbs: Engineering not Computer Science   ","date":1603121175,"description":"Assgn 1c","lastmod":"2020-12-20T15:26:15Z","objectID":"c4def7dd927d5d650799c196e39d437c","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn1c/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 1c"},{"content":"Assgn 2a (individual): Git and Bash Instructor Instructions:\n For this assignment students submit directly on Github repo. Instructor needs to have this repo available for the students and to replace our repo link at Step 4 of the exercise. Suggested time: 7 days  Posting for Students:\nPractice assignment for Git+Bash\nOverview  Download Git from https://git-scm.com/ Start “Git Bash” (or \u0026amp;ldquo;Git Shell\u0026amp;rdquo;) on Windows, or open a Terminal on Mac Configure username, email, and editor in git Fork repo https://github.com/cengique/bash_basics on Github Clone your repo to your local computer in Git Bash Make changes: Create a folder with your name, add a Bash script that prints your name Add your file to git Commit changes Push changes Create pull request  Step by step instructions Step 1 \u0026amp;amp; 2: Download Git and start a shell All Git downloads can be found on https://git-scm.com/downloads\n On Mac, open a terminal and type git to check if you have it already installed. Otherwise, you have two options, (1) install XCode from the App Store, but note that it is a large download; or (2) download the package from the link above. The rest of the assignment can be performed in the terminal console. On Windows, download the package from the above link. During installation it will ask you to choose a text editor. DO NOT SKIP THIS STEP! Pause the installation and install one of the editors on the list (Atom, Sublime Text, Notepad++, etc). Otherwise, you will have to set this up manually in the steps below, which is much harder. After installation completes, start the “Git Shell” from Programs. Note that inside the bash shell the folder separators will be forward slashes (/) instead of backslashes (\\).  Step 3: Configure username, email, and editor in git  git config --global user.name \u0026amp;quot;Your Name\u0026amp;quot; git config --global user.email \u0026amp;quot;\u0026amp;lt;Your Email\u0026amp;gt;\u0026amp;quot; (Make sure email matches Github account, or simply add one more email to Github) git config --list (Shows …","date":1603121175,"description":"Assgn 2a","lastmod":"2020-12-20T15:26:15Z","objectID":"5bb725f84dffbe8eb488201ea79dfd67","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn2a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 2a"},{"content":"Assgn 2b (individual): Git branching \u0026amp;amp; merging Instructor Instructions:\n For this assignment students submit directly on Github repo. Instructor needs to have this repo available for the students and to replace our repo link at Step 4 of the previous exercise (Assgn 2a). Suggested time: 7 days  Posting for Students:\nPractice assignment for Git+Bash\nGit Practice #2: Checkout and branch Note: Always prefer the official Git documentation and its reference manual to learn about the git commands rather than following random, outdated, and misleading tutorials from the web. If you don\u0026amp;rsquo;t remember syntax of a specific git command, try the --help option (e.g., git commit --help). Two exceptions I will recommend are the simple git guide and Learn Git Branching - a testing environment for you to play around branches.\nPart I: Parallel universes This exercise will make changes in one file in two parallel branches.\n Go back to your clone of bash_basics on your computer. Pick any one of the numbered Bash scripts. Run it using sh \u0026amp;quot;name of script\u0026amp;quot; in your Git Bash to see what it does, and then do the exercise described in the comment section at its end by adding new commands to the file. You can look inside the basics.sh file to get some hints, or use the Conquering the Command Line book . Add and commit your edited file, and push back to your own Github fork like last time (Note: If you\u0026amp;rsquo;re committing to a new branch name, make sure to git push --set-upstream origin \u0026amp;quot;name\u0026amp;quot;, like we did in the previous assignment). Now, we will look into the history to see a suitable place to travel back in time before our last commit. Use the git log command (or the commit lists in the UIs) to find the ID# of your first commit from last assignment. Press \u0026amp;ldquo;q\u0026amp;rdquo; to quit from the git log command. The actual time travel is achieved by using the git checkout \u0026amp;quot;ID#\u0026amp;quot;command, using the \u0026amp;ldquo;ID#\u0026amp;rdquo; from the previous step, which will transform your …","date":1603121175,"description":"Assgn 2b","lastmod":"2020-12-20T15:26:15Z","objectID":"7cd2641e6509d7664859d83e095e43e6","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn2b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 2b"},{"content":"Assgn 3a (team): Projects descriptions \u0026amp;amp; team formations Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them form teams. Suggested time: during class or end of the day of the class  Posting for Students:\nThis is the list of projects available to work on this semester:\n Project 1 title  Client:\nDescription:\nTechnology, if any:\nProject 2 title  Client:\nDescription:\nTechnology, if any:\nPlease read the project description (we will discuss them briefly in class) and decide on which project you would like to work on. Also, select your own team and convince your team to work on the project (we will work on this in class). Then, decide on the team name and post it below, along with the names of the team members and the project name. Chose a meaningful fun team name; it will be your Github project name. We will use this for naming the Discord channel and Github team code repo. Give exact spelling.\nRule: Teams must be at least 3 and up to 4 people. Exception; to be a 5-person team, you really need to justify why you need so many people. That doesn\u0026amp;rsquo;t mean \u0026amp;ldquo;oh this project is so big!\u0026amp;rdquo;, you have to clearly separate the work into different members. While teams of 2 will be allowed under some circumstances, I highly suggest to avoid them, since projects have many tasks and you will get easily overwhelmed by the amount of work.\nPost under the format:\nProject name:\nTeam name:\nMember 1:\nMember 2:\nMember 3:\nMember 4:\n","date":1603121175,"description":"Assgn 3a","lastmod":"2020-12-20T15:26:15Z","objectID":"db214ab522a2bd7b8f38221aa8b3585b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn3a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 3a"},{"content":"Assgn 3b (team): Client meeting and Requirements Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. Suggested time: 7-10 days  Posting for Students:\nClient meeting and Requirements\nContact your client(s) and have a meeting with him/her/them this week:\n  Set up a meeting with the clients. Ask them to give you 2-3 times, or simply offer several options yourself to speed up the process. CC me on your email to your client.\n  Post files in your team repo reflecting the log of the client meeting and the requirements document (1-2 pages) explained below. Make a folder /doc in your repo and put these files within this folder.\n  Requirements report:\n  Make a folder called docs_Fall2020/ in your repo. This will be the folder where you will be submitting your project documents throughout the semester.\n  Think of each person\u0026amp;rsquo;s skills and what you\u0026amp;rsquo;d like to learn to pick a platform and framework to learn and use this semester.\n  Make a new list of requirements.\n  Requirement list should include:\n  priority\n  justification\n  separation of functional, non-functional, and domain requirements\n  ","date":1603121175,"description":"Assgn 3b","lastmod":"2020-12-20T15:26:15Z","objectID":"668a8a9d0743da06db5eec37128e991b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn3b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 3b"},{"content":"Assgn 4a (individual): Project roles Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them work with their teammates. Suggested time: 3-5 days  Posting for Students:\nProject Roles:\nProgrammer\nSet 1:\n Code architecture/lead programmer - in charge of the framework, components, coding style, and programming. It doesn\u0026amp;rsquo;t mean the only programmer! Everyone must program, lead programmer decides on the overall design and coding standards. UI/UX design: User Interface and User eXperience. Make mock UI designs and user-friendly navigation. Implements and tests interface. Data modeler: Implements Database, data files, server-client structure, and data structures.  Set 2:\n Team manager: Sprint planning, and time accounting for the team. Client liaison: Communications, demos, and negotiations with the client, what was done and planned to handle the client\u0026amp;rsquo;s requirements (role can be combined with the manager) Documentation lead: Setup documentation conventions for code and project, then delegate work onto teammates. Manage presentations, reports, and licensing documentation. Every one must add documentation! Testing lead: Setup testing framework and conventions. Use continuous integration to test at each commit/push. Everyone must do their own testing!  In addition to the programmer role, each team member has 2 roles within the team, one from Set 1 and one from Set 2. These are roles you can pick. Later in the semester, you would need to give a presentation on your primary role, or it could include a mix of two roles. If multiple team members are working on the same role, the grade will get divided among them. You must have a primary role to get full points.\nNote that all roles are mandatory and each person in the team may need more than one role in order to get full points on the project.\nAssignment requirements:\n Each person must pick one or more roles from the list …","date":1603121175,"description":"Assgn 4a","lastmod":"2020-12-20T15:26:15Z","objectID":"08e7237277037df7be1c807eee581c73","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn4a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 4a"},{"content":"Assgn 4b (individual): Role in Markdown in Readme.md repo Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them work with their teammates.. Suggested time: 7-10 days  Posting for Students:\nProject Roles:\nJust to be clear! Everyone in the team MUST do code implementation in order to pass this class. In addition to the programmer role, each team member has 2 roles within the team. These are roles you can pick. Later in the semester, you would need to give a presentation on your primary role, or it could include a mix of two roles. If multiple team members are working on the same role, the grade will get divided among them. You must have a primary role to get full points.\n Code architecture/lead programmer: framework, components, coding style. Doesn\u0026amp;rsquo;t mean the only programmer! Everyone must program, lead programmer decides on the overall design and coding standards. UI/UX design: User Interface and User eXperience. Make mock UI designs and user-friendly navigation. Data modeler: Database, data files, server-client structure, data structures. Team manager: Sprint planning, and time accounting for the team. Client liaison: Communications, demos, and negotiations with client, what was done and planned to handle client\u0026amp;rsquo;s requirements (role can be combined with manager) Documentation lead: Setup documentation conventions for code and project, then delegate work onto teammates. Manage presentations, reports, and licensing documentation. Everyone must add documentation! Testing lead: Setup testing framework and conventions. Use continuous integration to test at each commit/push. Everyone must do their own testing!  Note that all roles are mandatory and each person in the team may need more than one role.\nAssignment requirements:\n Each person must pick one or more roles from the list above. Each team must have all of the roles distributed among its members. Access your …","date":1603121175,"description":"Assgn 4b","lastmod":"2020-12-20T15:26:15Z","objectID":"73ae30dc218dc4881046630242be30c6","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn4b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 4b"},{"content":"Assgn 5a (individual): Jira practice Instructor Instructions:\n Students will submit directly on Jira server. Instructor must provide students a Jira project link where they will practice on the server. Suggested time: 7 days  Posting for Students:\nPractice assignment for Agile progress tracking in JIRA This is a practice assignment, do not put your actual project user stories here. We will create mock versions of sprints, epics, user stories, and subtasks.\nEven though JIRA is not your progress tracking tool of your choice this semester, we will use it to practice Agile concepts. Look into the Atlassian documentation for JIRA here to get started or if you get stuck in any of the following steps.\nSteps   Look in your GGC email for an invitation from me into your JIRA account.\n  Log into JIRA using the link on the course page.\n  Under the Projects menu, click View all projects and find project title given in the assignment post. Select the Backlog from the left side menu - it is the default screen when you open a project.\n  If noone in your team has done it yet, create a new Epic name \u0026amp;ldquo;team name/project name\u0026amp;rdquo; with the summary \u0026amp;ldquo;a team (team name) of students can develop (project name)\u0026amp;rdquo;, where you replace \u0026amp;ldquo;team name\u0026amp;rdquo; and \u0026amp;ldquo;project name\u0026amp;rdquo; with the respective names from your currently assigned team project. To create the Epic, click on the Create button on top of the screen and select the appropriate options.\n  Under your team Epic, create one User Story for yourself. In the Epic detail view, click on the \u0026amp;ldquo;+\u0026amp;rdquo; sign on the Issues section. Alternatively, use can still use the Create button, but make sure you select the Epic to link at the bottom of the form. The story should explain your role in the project, such as \u0026amp;ldquo;Developer (name) will (your role in project) such that (reason for selecting role)\u0026amp;rdquo;. Assign this story to yourself.\n  Drag your personal story from the backlog list into the current Sprint. Add …","date":1603121175,"description":"Assgn 5a","lastmod":"2020-12-20T15:26:15Z","objectID":"e83dd4a5ff2b025bed8fb0e5463fe5f0","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn5a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 5a"},{"content":"Assgn 5b (team): Jira - Add user stories to team progress tracker Instructor Instructions:\n Students submit directly on Jira server. Suggested time: 7 days  Posting for Students:\nEach team member is responsible for:\n having registered into the progress tracker selected for your team, contribute to creating epics/user stories/tasks (created by the user), having a user story/task/chore assigned, and keeping track of the times s/he spent on studying/preparing/working on tasks.  Epics/User stories (use \u0026amp;ldquo;Issues\u0026amp;rdquo; in JIRA) must have:\n Title/Summary: answers to who, what, why questions. Example: \u0026amp;ldquo;As a user, I need to do something because of some reason\u0026amp;rdquo; Story points/difficulty/estimate: A previously agreed-upon numbering grade that indicates difficulty. Priority (ordering/drag-drop is fine) Epics are optional; use them sparingly.  User story subtasks must have:\n Informative and detailed title and proper system requirement details Estimated hours that you think it\u0026amp;rsquo;s going to take Continuous tracking of your hours as you work on it Been assigned to a person  Make sure that user stories are substantial. Some tasks can be added as chores instead of user stories. User stories must be from the perspective of the user, and NOT from the perspective of the developer. Eg., \u0026amp;ldquo;adding color/button for login to interface\u0026amp;rdquo; is not a user story; it can be added as a subtask of a user story or as a chore.\n","date":1603121175,"description":"Assgn 5b","lastmod":"2020-12-20T15:26:15Z","objectID":"78168aa74e6986f863b5043bc085564b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn5b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 5b"},{"content":"Assgn 6a (team) - CREATE abstract Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them work with their teammates.. Suggested time: 3-5 days  Posting for Students:\nGeneral CREATE event:\nWhen: Thu Nov 12th, 2-3:15 pm\nWhere: online\nBy Oct 7th, we need to receive one abstract from each team. You can post them below as a follow-up. Information you need to include:\nProject title:\nStudent names:\nA short abstract (max 150 words):\nHere are 2 example abstracts:\nVSEPR Venture\nAs part of our Software Development II course with Dr. Cengiz Gunay, we have been working on VSEPR Venture. In VSEPR Venture, the player is given the name of a molecule and given the task of collecting atoms and correctly putting them in a molecular structure that represents that molecule. The game contains many levels and varying difficulties to help the player learn basic concepts of the VSEPR theory.\nChemXplosion\nAs part of our Software Development II course with Dr. Cengiz Gunay, we have been working on ChemXplosion. In ChemXplosion, the player is given a puzzle and given the task of collecting the right element and correctly putting them in the equation right. The game contains many levels and varying difficulties to help the player learn basic concepts of Stoichiometry.\nDetails on the schedule and the rooms will be announced later.\n","date":1603121175,"description":"Assgn 6a","lastmod":"2020-12-20T15:26:15Z","objectID":"ba339526eae33af8f97ed2020fe18f1a","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn6a/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 6a"},{"content":"Assgn 6b (team): Project Flyer for CREATE Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them work with their teammates.. Suggested time: 3-5 days  Posting for Students:\nPost a good looking flyer of your project\nFlyer should include Project title, Team name, Names of all team members, and a nice design showcasing your project most important feature(s) (optional a short naration about the project can be incorporated).\nFlyer should be as png or jpg images, or pdf file.\n","date":1603121175,"description":"Assgn 6b","lastmod":"2020-12-20T15:26:15Z","objectID":"3d4a77880ac2f98a7dd9934e759ecafd","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn6b/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 6b"},{"content":"Assgn 7 (individual): JSON quiz Instructor Instructions:\n Suggested time: 3-5 days  Posting for Students:\nJSON Quiz\nSubmit your JSON results obtained by taking the JSON quiz at the link below. To get full points you need to score at least 70% on the quiz at the point. You can take several quizzes and submit your best score. Note: you need to create a free account to access these materials.\nJSON quiz Help:\n  Stanford JSON quiz   Intro to JSON   JSON Demo   ","date":1603121175,"description":"Assgn 7","lastmod":"2020-12-20T15:26:15Z","objectID":"4e6eb297d9a4693a59ffae9288c8439d","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/assgn7/","publishdate":"2019-11-23T15:26:15Z","title":"Assgn 7"},{"content":"Presentations (individual): Tools and Articles Instructor Instructions:\n This assignment should be posted on the class platform to allow all students to see each other entries. This will help them learn from their teammates presentations. Suggested time: after midterm till end of semester Presentation Time: 20 min/ student  Posting for Students:\nTools and Articles - presentations guidelines\nEach of you must either pick an article or one of the tools in any of the below topics during this semester. You must do all of the following:\n  select your tool/article and post its name below as a followup, along with the date you prefer to present it\n  submit a presentation file before the presentation time as a followup below; if you present a tool and show a demo then you also must submit your code files in a zip\n  present for 10-15 minutes in class\n  Important: when you\u0026amp;rsquo;re picking a tool/article, give me 2-3 dates when you can present it, so I can schedule the presentation. Last class you can schedule your presentation is Nov 5th, 2020.\nTwo types of TOOL presentations are allowed:\n  In-depth look at a tool with new information (has to be distinct from previous presentations on the same topic and must refer to them). Include your code demo of how it works on 2-3 tasks, show, and explain code.\n  Comparison of several tools using tool presentations from previous semesters to recommend one for a use case. Include your demo of how they work on 1-2 tasks, show, and explain code in all the tools you selected. Make your comparison point(s) via the code.\n  The in-depth look presentations will be graded based on the existence of the following information:\n Basic description of the tool. You can include live demos or online videos. Make sure everyone can get a grasp of the basic principles. Refer to and compare with info from previous presentations. Who uses it? Which companies are known to use this? How is it useful for us? Would you use it? How does it compare with other tools …","date":1603121175,"description":"Presentations","lastmod":"2020-12-20T15:26:15Z","objectID":"41ca02bdd05a218e712ac3a82921b83a","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/assignments/presentations/","publishdate":"2019-11-23T15:26:15Z","title":"Presentations"},{"content":"Exams There are two take-home exams during the semester, each with weight of 10 pts of the fnal grade. See next for the exam questions.\n","date":1603121175,"description":"Exams","lastmod":"2020-12-20T15:26:15Z","objectID":"326e4c3e83433151edcdc7fadb35e00d","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/exams/","publishdate":"2019-11-23T15:26:15Z","title":"Exams"},{"content":"Final Instructions:\n  Recommended work time 240 minutes.\n  Recommended Period: one week\n  Students can leave the work, save it, and return later to pick up where they left.\n  Total points 100 (100%).\n   Q1: Team Process (20 pts) Write an insightful analysis of the software process your team used during the project throughout the semester by answering the following questions:\nPart A (10pts): Identify 3 positive principles about teamwork and approach to software development that you observed and followed in your semester-long experience. Explain why it worked well and why. They must be specific to your team project, otherwise you do not get full points.\nPart B (10pts): Explain 3 issues that went wrong with your team project, and how you would modify the process if you had to do it all over again. I\u0026amp;rsquo;m not asking about small technical problems you encountered, but about the whole semester-long experience. Examples of issues would be on sprint planning, team roles, estimation and assignment of tasks, communication, etc.\n Q2: Personal Role (15 pts) Each team member had a specific role to play in the project, which changed over time. Please answer the following questions about your personal role(s):\nPart A (5pts): What were your roles in the each of the iterations this semester? Explain what was your strategy for selecting your initial role(s). Describe the duties (tasks) expected of and product outcomes specific to your role(s). How did your role change over iterations, and what were the reasons?\nPart B (5pts): What were the biggest challenges you faced in accomplishing those duties? In what ways do you feel you did a good job in your role? If you had the same role for another project beginning next week, what would you do differently?\nPart C (5pts): Do you feel your role was harder, easier, or equivalent to other roles in the project? Compare it to each of the other roles in your team, and give each role a score between 1 (easiest) to 5 (hardest). Note that this is …","date":1603121175,"description":"Final","lastmod":"2020-12-20T15:26:15Z","objectID":"b2f86f27774e23dbabb3730258e30928","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/exams/final/","publishdate":"2019-11-23T15:26:15Z","title":"Final"},{"content":"Midterm Instructions:\n  Recommended work time 180 minutes.\n  Recommended Period: one week\n  Students can leave the work, save it, and return later to pick up where they left.\n  Total points 50 (100%).\n  There are Bonus points included for students who want to answer to these questions.\n   Q1: Agile Methodology (10 pts) During the last decade, Agile Methodology has become a very popular software process model, which is supported by the State of the Agile report.\nPart A (5pts):\nA1. (3pts) Based on the data in this report (read The 14th annual STATE of AGILE Report, 2020 ), what are the top 3 features of Agile that are different from the traditional software engineering approach and make it so popular? Justify your selections by giving reasons.\nA2. (2pts) Research and list 3 weaknesses of Agile you think makes it less desirable. Your answers must cite numbers/info in the latest report The 14th annual STATE of AGILE Report, 2020 .\nPart B (5pts):\nB1. (2pts) Explain why you think Agile is (or is not) an appropriate process model for your class team project. Construct a convincing argument that includes whether stand-up meetings, sprint planning, user stories, and retrospectives are useful, and whether other Agile features are useful for your team.\nB2. (3pts) Create two semester-long development plans for your current project: one using a Waterfall model, and another one using an Agile model, and then compare the two.\n Q2: Object-oriented Design (10 pts) Answer BOTH of these questions based on information from multiple sources:\nPart A (5pts): What is the main purpose of object-oriented (OO) design and programming, and why did it become so popular in the software world? Is that popularity fading? Do some research and discuss about its weaknesses. Discuss when it is proper to use full-fledged OO design versus when it is excessive. Give examples of popular languages, frameworks, or use-cases that are not object-oriented. Give references to your sources.\nPart B (5pts): Choose …","date":1603121175,"description":"Midterm","lastmod":"2020-12-20T15:26:15Z","objectID":"d95635c63bd499c0f495b3f5806a0170","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/exams/midterm/","publishdate":"2019-11-23T15:26:15Z","title":"Midterm"},{"content":"Grading overview The overall ratio is about half between individual and project work (with bonus points):\n   Percent Grade category     10% Presentations (Article Reading + Software Tool) \u0026amp;amp; lab session attendance   15% Small individual assignments (including team formation and project selection)   5% In-class quizzes   20% Take-home mid-term and final exams (10% each)   50% Team Project, includes individual and team components:    Team peer review (multiple times)    Individual Role Presentation \u0026amp;amp; Execution    Individual Team/Client Communication    Proper and efficient use of Version Control    Waterfall steps of requirements, design, implementation, and testing    Team Release \u0026amp;amp; Demo Plans and Execution    Team Documentation \u0026amp;amp; Delivery Report    ","date":1603121175,"description":"Gradebook","lastmod":"2020-12-20T15:26:15Z","objectID":"13b75dfddc354d97474fe3b0aad68e8b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/gradebook/","publishdate":"2019-11-23T15:26:15Z","title":"Gradebook"},{"content":"Week#ModuleSetupTopicHands-onAssignment    // Schedule as JSON var modules = [ {name: \u0026#34;Semester overview and re-introduction to software engineering\u0026#34;, setup: \u0026#34;Initialize LMS, archive and clear discussion area, post syllabus, post intro slides, set up entry quiz, make discussion posts for welcome message, Message in a Bottle, and Introductions. Post project ideas and potential clients.\u0026#34;, topic: \u0026#34;Intro slides. Warning about self work. Go over success tips on LMS.\u0026#34;, handson: \u0026#34;Entry quiz, answer the questions, and post resume.\u0026#34;, module: 1, assignment: \u0026#34;Post introductory resumes. Regiser with version control (Github) and chat/forum services (Discord, Reddit). Vote for project ideas.\u0026#34;, days: 7}, {name: \u0026#34;Technology overview, project/team selection, and requirements\u0026#34;, setup: \u0026#34;Add everyone to LMS/version control/chat/discussion services. Post hackathon and local meetup schedules. Post requirements and Git lecture slides. Create team chat channels and code repositories with master branch force push protection.\u0026#34;, topic: \u0026#34;Explain shortcut links on LMS for chat and discussion. Brief introduction to tools (e.g., Discord usage and channels).\u0026#34;, handson: \u0026#34;Introduce and start assignment in class.\u0026#34;, module: 1, assignment: \u0026#34;Git+bash assignment; client meetings, read on Git and requirements.\u0026#34;, days: 7}, {name: \u0026#34;Markdown, team roles, technology overview\u0026#34;, setup: \u0026#34;Post assignments and role presentation details on LMS. Schedule attending external meetup/hackathon event.\u0026#34;, topic: \u0026#34;Announce project deadlines. Project setup help. Explain communication grading.\u0026#34;, handson: \u0026#34;assignment, project set up, markdown\u0026#34;, module: 1, assignment: \u0026#34;Post team roles in Markdown README and Git branching homework. Read about Agile. Sign release waivers.\u0026#34;, days: 7}, {name: \u0026#34;Agile development, user stories, JIRA\u0026#34;, setup: \u0026#34;post 1st iteration presentation deadline, and two JIRA assignments. Invitations for registering into JIRA, create JIRA project for practice assignment and one for each team. Add team managers as …","date":1603121175,"description":"Schedule","lastmod":"2020-12-20T15:26:15Z","objectID":"d047b671a88d2c4437317d9fb74b8e91","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/schedule/","publishdate":"2019-11-23T15:26:15Z","title":"Schedule"},{"content":"Syllabus Example Syllabus which includes learning outcomes, textbook, schedule and details about the course organization.\nParts that instructor needs to change to his/her own data are emphasized in yellow.\nDownload pdf of Syllabus here. Download word doc of Syllabus here. ","date":1603121175,"description":"Syllabus","lastmod":"2020-12-20T15:26:15Z","objectID":"2dbf0565756b6df943a700c93c819e80","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/instructor/syllabus/","publishdate":"2019-11-23T15:26:15Z","title":"Syllabus"},{"content":"Select a chapter from the menu.\n","date":1603121175,"description":"Student Materials","lastmod":"2020-12-20T15:26:15Z","objectID":"d9abbfdff770a90a77fcbeafefb538ab","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/","publishdate":"2019-11-23T15:26:15Z","title":"Student Materials"},{"content":"Agile Development ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Agile Process The current standard for software development\n Waterfall  = sequential assembly line   What is wrong with Waterfall?   In 1990s, software industry abandoned waterfall-style development and introduced AGILE\n  Manifesto for Agile Software Development \u0026amp;ldquo;We are uncovering better ways of developing software by doing it and helping others do it. Through this work we have come to value:\n Individuals and interactions  over processes and tools Working software  over comprehensive documentation Customer collaboration  over contract negotiation Responding to change  over following a plan  That is, while there is value in the items on the right, we value the items on the left more.”\nKent Beck et al\n Agile Statistics The 14th annual STATE of AGILE Report, 2020\n   Agile Statistics The 14th annual STATE of AGILE Report, 2020\n   Agile Statistics The 14th annual STATE of AGILE Report, 2020\n   Agile Statistics The 14th annual STATE of AGILE Report, 2020\n   Agile Statistics The 14th annual STATE of AGILE Report, 2020\n   ","date":-62135596800,"description":"","objectID":"10982256fb9e8de7109341557b86ee00","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-agiledevelopment/","title":"Agile Development"},{"content":"Kanban ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Kanban Kanban is a management method helping teams to visualize their work to understand it better, which helps to identify and eliminate bottlenecks, and maximise efficiency (flow). It is the Japanesse word for visual signal. The original author of Kanban was Taiichi Ohno and it was used by Toyota for the first time.\nA Kanban Board keeps everyone in the team on the same page.\n Teams build a Kanban board filled with Kanban cards and set up a work flow limit.\n    Kanban cards One Kanban card per user story, which means one card per work item.\nThe size of the work item should not be either too small or too big.  Cards should have:\n title, description, owner, any other helpful information like due date   As card moves on the board from left to right on the stage of the workflow, the card gets some history (i.e., messages from the teammates).\n Kanban cards should be small enough such that team makes progress on them in a reasonable amount of time.\n  Kanban work flow   Work flow: cards moving from left to right\n Benefits of Kanban board  reveals bottlenecks in workflow (cards not moving forward)    get a sense of the size of the cards team can move forward in a timely matter    a visual assurance that the work is done    Measuring workflow lead time = the time it takes a card to move from the backlog to finish on the board\nIn agile, if values are combined with Kanban characteristics, the outcome would be Agile Kanban. This practice is gaining popularity in Software Developmement, and it means that the Agile iteration approach and Kanban value stream focus are combined.\n","date":-62135596800,"description":"","objectID":"2e15fc0e429e9259bc9f4e4d5a244481","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-agiledevelopment/chapter-kanban/","title":"Kanban"},{"content":"Agile Principles ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n What is \u0026amp;ldquo;AGILITY\u0026amp;rdquo;? Effective (rapid and adaptive) response to change  Effective (rapid and adaptive) communication among all stakeholders  The CLIENT is part of the TEAM  The TEAM is in control of the work performed   resulting in \nrapid, incremental delivery of software\n  Agile Process  User Scenarios are descriptions of what is required (requirements) and drive the entire production process    Plans are short-lived and can change frequently    Software is developed iteratively and is delivered after each iteration    Adapts as changes occur    Agile is based on 4 values and  12 principles   Agile Values  Individuals and interactions over processes and tools   Working software over comprehensive documentation   Customer collaboration over contract negotiation   Responding to change over following a plan    Agile Principles  Satisfy the Customer  Our highest priority is to satisfy the customer through early and continuous delivery of valuable software.\n Welcome Change  Welcome changing requirements, even late in development. Agile processes harness change for the customer\u0026amp;rsquo;s competitive advantage.\n Deliver Solutions Frequently  Deliver working software frequently, from a couple of weeks to a couple of months, with a preference to the shorter timescale.\n  Agile Principles Work Together  Business people and developers must work together daily throughout the project (one team).\n Empower \u0026amp;amp; Trust  Build projects around motivated individuals. Give them the environment and support they need, and trust them to get the job done.\n Face to Face Conversations  The most efficient and effective method of conveying information to and within a development team is face–to–face conversation.\n  Agile Principles Working Solutions  Working software solutions are the primary measure of progress.\n Sustainable Pace  Agile processes promote sustainable …","date":-62135596800,"description":"","objectID":"3361e5f40a770cb713abc67c0df8a57b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-agiledevelopment/chapter-principles/","title":"Agile Principles"},{"content":"Scrum ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Scrum * Originally proposed by Jeff Sutherland in 90s, then improved by Schwaber and Beedle  * In 1993, J. Sutherland borrowed term ‘scrum’ from Takeuchi and Nonaka, “The New Product Development Game”, Havard Business Review, 1986  * Takeuchi and Nonaka compare high-performing, cross-functional teams to the scrum formation used by Rugby teams.     Scrum * In rugby scrum is the power struggle between two teams to advance on the field  * It requires complete team work, hard work, and strength. That meaning translates to software development    See original article from Scrum Alliance\n Scrum and Agile Scrum is one of several agile frameworks.  Scrum is the most popular agile framework.\n    Scrum Definition Scrum: An [agile] framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\nScrum refers to a lightweight framework that is used in every industry to deliver complex, innovative products and services that truly delight customers. It is simple to understand, but difficult to master.  Scrum fulfils the vision of the Agile Manifesto by helping individuals and businesses organize their work to\n maximize collaboration, minimize errors, deliver frequently, and create multiple opportunities to inspect and adapt.   Scrum Guide, November 2017 version\n How Scrum works Scrum works by delivering large projects in small chunks of the product that a team can begin and complete in one, short timeboxed iteration called sprint.\nScrum is also both iterative and incremental.   Scrum Framework People are the focus of Scrum.\nScrum Teams include people with diverse skillsets; each team has all of the capabilities necessary to deliver a piece of functionality from idea to delivery.  Sprint is a short (one to four weeks long) timeframe during which the team works on some chunks of the product. …","date":-62135596800,"description":"","objectID":"d4f93296160149860fba04ae846614f6","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-agiledevelopment/chapter-scrum/","title":"Scrum"},{"content":"Re-introduction to Software Engineering ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (Some slides courtesy of Joan Smith, Eugene Agichstein, and the Internets. License: CC BY-SA 4.0)\n  \n Welcome  What\u0026amp;rsquo;s better than to start the semester with a quiz?  Logistics heads-up:\n Using Reddit/Piazza for forum discussion and Q\u0026amp;amp;A support Sections 1 \u0026amp;amp; 2 are separate, but follow same content Using Discord and Github organizations with previous members Everything online this semester, will meet on live video on Discord   Meaning:\n Bigger community, can see what others are doing Can see results of their research, answers to questions Can even collaborate with projects? Any problems, potential issues?    Meet your instructor Instructor: Dr. Cengiz Gunay\nSoft-Eng-Practicum Github Organization\nEmail: cgunay@ggc.edu\nOffice: Virtual and W-2117 (by appointment)\nPhone: 678-951-9621 (also GroupMe)\n About the instructor: Dr Cengiz Gunay  Self-taught programmer In elementary school, started programming with an Atari 800XL  In high school, won programming competition with word puzzle game In college (\u0026amp;lsquo;96), published PC video game called “Legends of Istanbul”  In 2003, got a PhD in Computer Science on neural networks 2004–15, worked as post-doctoral fellow at Emory Univ. on simulating models of biological neurons and large-scale biological data mining (e.g., SQL, neural nets, genetic algos) 2012–15, Visiting Faculty teaching at Emory Univ., Math \u0026amp;amp; CS Dept. Fall 2015–present, IT faculty at GGC with Soft Dev focus and also helped start a Data Science and Analytics major   Your turn!  Login/register on discussion and respond to the “Introductions” topic; create an inline resume  Also quickly introduce yourself now in class!\n Name Major/Year Interest/experience in programming    What\u0026amp;rsquo;s happening? Welcome Soft Dev 1 students\n Projects, working with external clients (mostly GGC faculty/students) 3 phases of project work, peer review in each with …","date":-62135596800,"description":"","objectID":"080b37ae39eb6a14aeb12b2b9b918708","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-intro/","title":"Re-introduction to Software Engineering"},{"content":"Career Advice and Technologies  ","date":-62135596800,"description":"","objectID":"0d8b6c4ef967253c279a6c1cf442efcd","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-intro/career-advice-technologies/","title":""},{"content":"Technology Overview ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n Popular Javascript web frameworks Major players; require Node.js on the server\n Angular (Typescript) - a full framework, supported by Google React (JSX) - only a library. Invented by Facebook, but open source now Vue.JS (Javascript) - modeled by original Angular, independent and open source   Angular controlled by Google and may change, forces Typescript React needs other framework components Vue is youngest and less docs available    Non-JS web frameworks  Python  Django - Very extensive, open-source framework Flask - Minimal, light, open-source framework   C#  .Net Core - Controlled by Microsoft, but platform independent   Ruby on Rails - Open-source Ruby web framework, lost some steam recently PHP (legacy) – but good with new frameworks  Laravel - easy, video tutorials Yii - performant, but steep learning curve   Java  Java Server Faces (JSF) - Legacy Java Spring - similar to .Net, controlled by Oracle     Django comes with admin section. .Net Core: Heavily object-oriented, optional Angular for front-end. Very popular.    Mobile hybrid frameworks Hybrid: cross-platform (Android, iOS, …)\n Flutter (Dart) React Native (JSX, HTML, native) Ionic (Angular/React, HTML) – based on Cordova Xamarin (C#, XML, allows native code)   JSX is React\u0026amp;rsquo;s flavor of Javascript Xamarin requires to learn another XML    SQL Databases  No database SQLite – database in a single file, simplified MySQL/Oracle/PostGreSQL/MS SQL Server – legacy, centralized, powerful, requires server   SQL used to be standard but now one should ask if needed SQLite is local, so no centralized data need to run server    NoSQL databases Simpler, less powerful, cloud options available\n MongoDB - industry leader Firebase (Google) - easy for mobile apps Cassandra CouchDB - Good for highly distributed systems   Mongo and Firebase give small free allowance on cloud - get a database without running a …","date":-62135596800,"description":"","objectID":"e53dd87c91a1981c86c41aab6f89732a","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-intro/chapter-tech/","title":"Technology Overview"},{"content":"Jira ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Jira * Originally proposed by Jeff Sutherland in 90s, then improved by Schwaber and Beedle  * In 1993, J. Sutherland borrowed term ‘scrum’ from Takeuchi and Nonaka, “The New Product Development Game”, Havard Business Review, 1986  * Takeuchi and Nonaka compare high-performing, cross-functional teams to the scrum formation used by Rugby teams.     Scrum * In rugby scrum is the power struggle between two teams to advance on the field  * It requires complete team work, hard work, and strength. That meaning translates to software development    See original article from Scrum Alliance\n Scrum and Agile Scrum is one of several agile frameworks.  Scrum is the most popular agile framework.\n    Scrum Definition Scrum: An [agile] framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\nScrum refers to a lightweight framework that is used in every industry to deliver complex, innovative products and services that truly delight customers. It is simple to understand, but difficult to master.  Scrum fulfils the vision of the Agile Manifesto by helping individuals and businesses organize their work to\n maximize collaboration, minimize errors, deliver frequently, and create multiple opportunities to inspect and adapt.   Scrum Guide, November 2017 version\n How Scrum works Scrum works by delivering large projects in small chunks of the product that a team can begin and complete in one, short timeboxed iteration called sprint.\nScrum is also both iterative and incremental.   Scrum Framework People are the focus of Scrum.\nScrum Teams include people with diverse skillsets; each team has all of the capabilities necessary to deliver a piece of functionality from idea to delivery.  Sprint is a short (one to four weeks long) timeframe during which the team works on some chunks of the product. …","date":-62135596800,"description":"","objectID":"2f2461324e23907d9fec30e27b95ae90","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-jira/","title":"Project Management with JIRA"},{"content":"Team Roles and Presentation Checklist    Team manager section:\n  Brief recap of your client\u0026#39;s vision\n  In Agile philosophy, people come before tools. How does your team\u0026#39;s existing skills and future goals align with the project scope?\n  What were your brief list of requirements and how did you turn these into user stories?\n  What\u0026#39;s your plan for the semester? Outline it roughly, but tell us exactly what\u0026#39;s going into your 1st iteration/sprint and when do you plan to finish it to show it to the client. 1st iteration must be one month or shorter.\n  Here\u0026#39;s an example: GGRA project , video\n  Code Architecture section:\n  Justification and rationale for picking your platform/language/framework.\n  A diagram that shows different components of your project and how they relate\n  Folder structure that all your team members agreed to follow\n  Major code components (classes, files, controllers, etc)\n  Some details of the coding that is coming up\n  Here\u0026#39;s an example: CodeArchitecture.pptx, video\n  Optional:\n  IDE choice\n  Code style (spacing, naming, etc)\n  Any other relevant information\n  UI Designer section:\n  Explain existing interface and proposed changes, or show ideas/sketches for new design\n  Graphical representation of your UI, could be a mock (use Moqups, Proto.io, UXpin, Marvel, JustInMind, etc.)\n  Choose a state or activity diagram to show us the different views and the routes between them\n  Principles of organization that your teammates will follow to make UI elements\n  Planned future directions\n  Any other relevant information\n  Here\u0026#39;s an example: UserInterfacedesignv2.pptx, video\n  Data Model role section:\n  A class or entity-relationship diagram that shows different data components\n  Database engine, file format, code data structures, or any other way you incorporate data into your project and rationale why that was selected.\n  Flesh out the details of how the data is going to be accessed (files, scripts, functions)\n  Any other relevant information\n  Here\u0026#39;s an …","date":1603121175,"description":"Project Design and Management","lastmod":"2020-12-20T15:26:15Z","objectID":"de7170a50a9454767df0b7ac2326fa9b","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-project-design/","publishdate":"2019-11-23T15:26:15Z","title":"Project Design and Management"},{"content":"   Grading Criteria    Max Pts Grade item     100 Total student grade w/o bonus   125.33 Total student grade w bonus    Team scores will be posted below. Individual grades will be submitted privately in the D2L grades section. They are calculated the same way as in Requirements Phase:\n total individual grade = base grade + team score \u0026amp;times; individual effort percent\n  30 Base points 30 Individual effort multiplier 70 Team presentation/work    5 Selected tool/article 10 Git commits 5 Client partially functional demo  10 US and tasks progress updated 5 Process tool activity 5 Screencast of demo  10 Coding contribution 5 Other comm 10 Project and code progress  5 Time logging 10 Peer review 10 Iterations and USs updated      10 Client communication  10 Base bonus 2 Bonus effort 5 Iteration plan validated  5 Testing contribution 2 Extra effort 5 Client satisfaction  5 Documentation contribution   5 License/IP       5 Burndown      5 CREATE abstract      5 Demo aligned with requirements             10 Bonus project score      5 README with up-to-date links      5 Other    \n  ","date":1603121175,"description":"Client Checkpoint Phase","lastmod":"2020-12-20T15:26:15Z","objectID":"a538bfe2fc009626f1a15bea160ed135","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-project-design/client-checkpoint-phase/","publishdate":"2019-11-23T15:26:15Z","title":"Client Checkpoint Phase"},{"content":"   Deliverables In the final phase of this semester, you will have these main deliverables:\n App Factory Demos to outside of class people (usually during a symposium on campus/online in the last week of semester) Final team technical presentation in class (during last week of classes)  Demo deliverables (due TBA): Submit these on the forum post as a reply:\n  Project flyer: description of functionality with screenshots; include a single letter-size (11\u0026#34;x8.5\u0026#34;) page flyer in PNG format that has a screenshot or artwork and message to be the flash card for your product (see examples from previous semesters at https://soft-eng-practicum.github.io/ )\n  Intellectual property agreement signed by all team members and client (don\u0026#39;t post on repo, put it on Reddit)\n  App Factory Demo user testing survey draft - should be couple of questions specific to your project because I will give a second survey with generic questions (see example 1 and example 2)\n Provide a short screencast demoing your product live (prefer a screen recorder with voiceover rather than a hand-held camera). This will be a public video, don\u0026#39;t show private information that you don\u0026#39;t want to share. Upload it to Youtube and provide a link. (see examples from previous semesters at https://soft-eng-practicum.github.io/ )  Final technical presentation (due TBA) and report submission (due TBA) Post these on the forum:\n In-class presentation file. In your presentation file, make sure to include links for the live product/download/etc if they apply. Make sure they are shareable! See below to see what goes into the presentation. If you don\u0026#39;t want to post your presentation publicly, you can password-protect it. But don\u0026#39;t forget to post that password. Report, including signed agreement/license, screencast video (upload to Youtube and provide link), user testing results from App Factory. Report can be uploaded to your repo.  Emails that need to be sent out:\n All project materials including final deployment to client - …","date":1603121175,"description":"The Last Stretch Phase","lastmod":"2020-12-20T15:26:15Z","objectID":"9fa1d47e0966797833660b081a0a6f16","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-project-design/last-stretch-phase/","publishdate":"2019-11-23T15:26:15Z","title":"The Last Stretch Phase"},{"content":"   Grading Criteria    Max Pts Grade item     100 Total student grade   130 Total student grade with bonus    Individual grades and its bonus sum together, and the team points are MULTIPLIED by effort percent of the individual. They will be submitted privately in the D2L grades section. They are calculated tentatively as follows:\n total individual grade = base grade + team score \u0026amp;times; individual effort percent\n    50 Base points 25 Individual effort multiplier 50 Team score     10 Role markdown 10 Peer review 5 Meeting summary in repo and validated by client   15 2x role presentations 5 Github commits 2 Team name   5 Release waivers 5 Task tracking 5 Team markdown   10 Feedback for presentations 5 Communication (Slack/Discord) 5 Client feedback for mockup   10 User story (estimate, tasks, assigned)   5 Client communications     \u0026amp;nbsp; \u0026amp;nbsp; \u0026amp;nbsp; 8 1st iteration plans tracked     2 Bonus effort 5 User stories in backlog     2 Extra effort 12 All role presentations   10 Base bonus   3 Vlogs/presentations submitted   5 Voting for best presentations       5 Comments in tasks   10 Bonus project score       5 (bonus) for best project(s)       5 extra stuff      ","date":1603121175,"description":"Requirements Phase","lastmod":"2020-12-20T15:26:15Z","objectID":"d19dd391f25e6982cb6dd7e5d707e933","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-project-design/requirements-phase/","publishdate":"2019-11-23T15:26:15Z","title":"Requirements Phase"},{"content":"Requirements in Agile ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   What is a Requirement? Requirements are the descriptions of the services provided by a system and its operational constraints  * It is about WHAT not HOW  * It varies greatly. It may range from a high level abstract statement to a detailed mathematical specification  * It may be as complex as a 500 pages of description     Why we need requirements? Advantages of a complete set of documented requirements\n* Ensures the user (not the developer) drives system functionalities  * Helps avoiding confusion and arguments  * Helps minimizing the changes which reduces the cost  Changes in requirements are expensive.   Costs of changing the requirements 3 x as much during the design phase  5-10 x as much during implementation  10-100 x as much after release Code Complete, p30\n  Requirements help reduce errors A careful requirements process doesn’t mean there will be no changes later\nAverage project experiences about 25% changes in the requirements\n This accounts for 70-80% if the rework of the project Code Complete, p40\n Important to plan for requirements changes\n Example: the case of critical applications   Different levels of abstraction Abstract level: User requirements\n* Usually the first attempt for the description of the requirements * Includes services and constraints of the system * Given in natural language or diagrams * Readable by everybody * Serve business objectives  Example of User requirement: As a user who found a new job announcement, I want to add a new position to the website so s/he can start working on doing the initial research and apply to it.   Different levels of abstraction Not abstract level: System requirements\n* Includes services and constraints of the system in detail * Useful for the design and development * Precise and cover all cases * Structured presentation  Example of System requirement: A registered user on the academic jobs …","date":-62135596800,"description":"","objectID":"01729c77575845de382e80ebc5b9f9ca","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-requirements/","title":"Requirements in Agile"},{"content":"Client Meeting ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Client Meeting * Originally proposed by Jeff Sutherland in 90s, then improved by Schwaber and Beedle  * In 1993, J. Sutherland borrowed term ‘scrum’ from Takeuchi and Nonaka, “The New Product Development Game”, Havard Business Review, 1986  * Takeuchi and Nonaka compare high-performing, cross-functional teams to the scrum formation used by Rugby teams.     Scrum * In rugby scrum is the power struggle between two teams to advance on the field  * It requires complete team work, hard work, and strength. That meaning translates to software development    See original article from Scrum Alliance\n Scrum and Agile Scrum is one of several agile frameworks.  Scrum is the most popular agile framework.\n    Scrum Definition Scrum: An [agile] framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\nScrum refers to a lightweight framework that is used in every industry to deliver complex, innovative products and services that truly delight customers. It is simple to understand, but difficult to master.  Scrum fulfils the vision of the Agile Manifesto by helping individuals and businesses organize their work to\n maximize collaboration, minimize errors, deliver frequently, and create multiple opportunities to inspect and adapt.   Scrum Guide, November 2017 version\n How Scrum works Scrum works by delivering large projects in small chunks of the product that a team can begin and complete in one, short timeboxed iteration called sprint.\nScrum is also both iterative and incremental.   Scrum Framework People are the focus of Scrum.\nScrum Teams include people with diverse skillsets; each team has all of the capabilities necessary to deliver a piece of functionality from idea to delivery.  Sprint is a short (one to four weeks long) timeframe during which the team works on some chunks …","date":-62135596800,"description":"","objectID":"f91ead9747d57f950854052ae114d40d","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-requirements/chapter-client/","title":"Client Meeting"},{"content":"Communication ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Communication * Originally proposed by Jeff Sutherland in 90s, then improved by Schwaber and Beedle  * In 1993, J. Sutherland borrowed term ‘scrum’ from Takeuchi and Nonaka, “The New Product Development Game”, Havard Business Review, 1986  * Takeuchi and Nonaka compare high-performing, cross-functional teams to the scrum formation used by Rugby teams.     Scrum * In rugby scrum is the power struggle between two teams to advance on the field  * It requires complete team work, hard work, and strength. That meaning translates to software development    See original article from Scrum Alliance\n Scrum and Agile Scrum is one of several agile frameworks.  Scrum is the most popular agile framework.\n    Scrum Definition Scrum: An [agile] framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\nScrum refers to a lightweight framework that is used in every industry to deliver complex, innovative products and services that truly delight customers. It is simple to understand, but difficult to master.  Scrum fulfils the vision of the Agile Manifesto by helping individuals and businesses organize their work to\n maximize collaboration, minimize errors, deliver frequently, and create multiple opportunities to inspect and adapt.   Scrum Guide, November 2017 version\n How Scrum works Scrum works by delivering large projects in small chunks of the product that a team can begin and complete in one, short timeboxed iteration called sprint.\nScrum is also both iterative and incremental.   Scrum Framework People are the focus of Scrum.\nScrum Teams include people with diverse skillsets; each team has all of the capabilities necessary to deliver a piece of functionality from idea to delivery.  Sprint is a short (one to four weeks long) timeframe during which the team works on some chunks of …","date":-62135596800,"description":"","objectID":"f712b19a3831cd21d5025158307a9074","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-requirements/chapter-communication/","title":"Communication"},{"content":"Teamwork ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Teamwork * Originally proposed by Jeff Sutherland in 90s, then improved by Schwaber and Beedle  * In 1993, J. Sutherland borrowed term ‘scrum’ from Takeuchi and Nonaka, “The New Product Development Game”, Havard Business Review, 1986  * Takeuchi and Nonaka compare high-performing, cross-functional teams to the scrum formation used by Rugby teams.     Scrum * In rugby scrum is the power struggle between two teams to advance on the field  * It requires complete team work, hard work, and strength. That meaning translates to software development    See original article from Scrum Alliance\n Scrum and Agile Scrum is one of several agile frameworks.  Scrum is the most popular agile framework.\n    Scrum Definition Scrum: An [agile] framework within which people can address complex adaptive problems, while productively and creatively delivering products of the highest possible value.\nScrum refers to a lightweight framework that is used in every industry to deliver complex, innovative products and services that truly delight customers. It is simple to understand, but difficult to master.  Scrum fulfils the vision of the Agile Manifesto by helping individuals and businesses organize their work to\n maximize collaboration, minimize errors, deliver frequently, and create multiple opportunities to inspect and adapt.   Scrum Guide, November 2017 version\n How Scrum works Scrum works by delivering large projects in small chunks of the product that a team can begin and complete in one, short timeboxed iteration called sprint.\nScrum is also both iterative and incremental.   Scrum Framework People are the focus of Scrum.\nScrum Teams include people with diverse skillsets; each team has all of the capabilities necessary to deliver a piece of functionality from idea to delivery.  Sprint is a short (one to four weeks long) timeframe during which the team works on some chunks of the …","date":-62135596800,"description":"","objectID":"3ec90445a0593eb03a6d3d0e9fcd6d88","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-requirements/chapter-teamwork/","title":"Teamwork"},{"content":"User Stories ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   User Stories in Agile * The Agile process is driven by customer descriptions of what is required (user scenarios)  * Agile Planning begins with the creation of user stories  * User Stories are the central focus for developers  * User Stories are derived from user/client meeting and describe how the product will be used in very specific ways\n * They are derived from user scenarios and tell WHO can do WHAT and WHY  * Analogous to functional requirements  * Act as guidelines on how to plan for testing the product   User Stories in Agile * Agile team assesses each story and assigns a cost\n * Stories are grouped for a deliverable increment  * Complexity of a user story is estimated in Story Points. Story points estimate the relative complexity of satisfying the requirement.  * Each user story should imply an acceptance test  * Coding: Recommends the construction of a unit test for a story before coding starts  * A commitment is made on a delivery date for all the stories of the deliverable increment  * User stories should be recorded in virtual or physical cards placed on the team\u0026#39;s working board   Examples of User Story                       Examples taken from http://www.westborosystems.com/2010/02/user-story-examples/\n User Story might get history during the development    Initial Final               How to classify each story   Team must decide upon the criteria on which to classify each story.\n  Then, team must select a way to record the story using these criteria\n  Example: I.N.V.E.S.T.\nI – independent, not requiring other features\nN – negotiable, can be excluded, revised, etc\nV – valuable, clearly contributing to product usefulness\nE – estimable, reasonable development estimates can be made from the story\nS – small, stories that are too big tend to be vague and miss some points\nT – testable, stories need to have a means of verifying functionality   Developer …","date":-62135596800,"description":"","objectID":"ba9b60dfdb6db23d03e8a8179b571438","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-requirements/chapter-userstories/","title":"User Stories"},{"content":"Software Protection ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay Licensed with CC BY-SA 4.0\n","date":-62135596800,"description":"","objectID":"2e065a23fb36a64b24fb015bc4bd39f8","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-software-protection/","title":"Software Protection"},{"content":"Intellectual Property ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay Licensed with CC BY-SA 4.0\n","date":-62135596800,"description":"","objectID":"476773e1422c16a7a9566b5ae2739e8a","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-software-protection/intellectual-property/","title":"Intellectual Property"},{"content":"Licensing ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay Licensed with CC BY-SA 4.0\n","date":-62135596800,"description":"","objectID":"55be9cc3251b7fdcdc6cb58b9c5e13d1","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-software-protection/licensing/","title":"Licensing"},{"content":"Version Control ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay Licensed with CC BY-SA 4.0\n  \n Why Version Control?  It\u0026amp;rsquo;s a must in today\u0026amp;rsquo;s computing industry  Mt. Gox, a company that don\u0026amp;rsquo;t use VC and lost almost a billion dollars… Another painful story without VC challenge: find more horror stories!   You can even version control documents, class files, financial files, … Also called source control, code management, concurrent versioning, revision control, …  Advantages:\n Track changes, keep logs of past development Automatic backups/safety net Concurrent versions: XP vs. Win8 Allows teamwork    Teamwork on the same codebase: How? Seriously, how?   Teamwork: No control? Overwrite chaos!    Teamwork: Locking    Teamwork: Merging    Merging example    Each commit increments version   \n Github for version control     \n       git is the program behind Github Common usage scenario:\n git clone gets working copy from repo Make changes in local working copy git add \u0026amp;lt;files...\u0026amp;gt; to select your changed files git commit saves your changes into the version control history with a comment (Wash, rinse, and repeat step 2. Commit often!) git push publishes your previous commits to remote repository (Github) git pull receives latest changes from repo to sync   Useful commands: Investigating the past  git diff shows your changes from last repo version git log [filename] lists all commits, optionally those touching a filename git diff \u0026amp;lt;commit\u0026amp;gt; shows changes in version labeled as \u0026amp;lt;commit\u0026amp;gt; git checkout \u0026amp;lt;commit\u0026amp;gt; rewinds all files back to a version  Challenge: How to find a bug  You have been messing with the code Suddenly you realized you broke the program How do you find when was the bug introduced?    Hint: use git checkout \u0026amp;lt;commit\u0026amp;gt;\n    Common issues with Git Avoiding bloating and conflict hell:\n The .gitignore file: Add lines of file patterns to be kept out of your repo.  Mac vs PC guy: different line endings:\n Can …","date":-62135596800,"description":"","objectID":"17aeffb5f3818ad789d2b0335cde19ce","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-version-control/","title":"Version Control"},{"content":"Github Social Computing ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay Licensed with CC BY-SA 4.0\n","date":-62135596800,"description":"","objectID":"de98cdc066fba8ed9e080f3aa10348e8","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-version-control/github-social-computing/","title":"Github Social Computing"}]