[{"content":"Welcome! We are still adding materials. Select a chapter from the menu on the left.\n","date":1508426775,"description":"Home page","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/","publishdate":"2018-11-23T15:26:15Z","title":"Home"},{"content":"This site contains a collection of lectures, assignments, and instructor materials for teaching software engineering or development, at an intermediate level. It is assumed that students already know basic software engineering terms and skills.\nMaterials are used for the ITEC 3870 Software Development II course taught at Georgia Gwinnett College . They were developed by Cengiz Gunay and Anca Doloc-Mihu , supported by an Affordable Learning Georgia grant in 2019-2020.\nTo modify and use these materials in your classes, fork the Github repository or use the edit link at the bottom right of each page.\n","date":1508426775,"description":"About this Site","lastmod":"2019-10-26T15:26:15Z","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/about/","publishdate":"2018-11-23T15:26:15Z","title":"About this Site"},{"content":"We are still adding materials. Select a chapter from the menu on the left.\n","date":1508426775,"description":"Student Materials","lastmod":"2019-10-26T15:26:15Z","objectID":"d9abbfdff770a90a77fcbeafefb538ab","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/","publishdate":"2018-11-23T15:26:15Z","title":"Student Materials"},{"content":"Agile Development ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n   Agile Process The current standard for software development\n Waterfall  = sequential assembly line   What is wrong with Waterfall?   In 1990s, software industry abandoned waterfall-style development and introduced AGILE\n\u0026amp;lt;span class=\u0026amp;lsquo;fragment \u0026#39;\n   Manifesto for Agile Software Development \u0026amp;ldquo;We are uncovering better ways of developing software by doing it and helping others do it. Through this work we have come to value:\n Individuals and interactions  over processes and tools Working software  over comprehensive documentation Customer collaboration  over contract negotiation Responding to change  over following a plan  That is, while there is value in the items on the right, we value the items on the left more.”\n[Kent Beck et al] (http://agilemanifesto.org/)\n Agile Statistics [The 14th annual STATE of AGILE Report, 2020] (https://stateofagile.com/)\n   Agile Statistics [The 14th annual STATE of AGILE Report, 2020] (https://stateofagile.com/)\n     ","date":-62135596800,"description":"","objectID":"10982256fb9e8de7109341557b86ee00","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-agiledevelopment/","title":"Agile Development"},{"content":"Re-introduction to Software Engineering ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (Some slides courtesy of Joan Smith, Eugene Agichstein, and the Internets. License: CC BY-SA 4.0)\n   Welcome  What\u0026amp;rsquo;s better than to start the semester with a quiz?  Logistics heads-up:\n Using Reddit/Piazza for forum discussion and Q\u0026amp;amp;A support Sections 1 \u0026amp;amp; 2 are separate, but follow same content Using Discord and Github organizations with previous members Everything online this semester, will meet on live video on Discord   Meaning:\n Bigger community, can see what others are doing Can see results of their research, answers to questions Can even collaborate with projects? Any problems, potential issues?    Meet your instructor Instructor: Dr. Cengiz Gunay\nSoft-Eng-Practicum Github Organization\nEmail: cgunay@ggc.edu\nOffice: Virtual and W-2117 (by appointment)\nPhone: 678-951-9621 (also GroupMe)\n About the instructor: Dr Cengiz Gunay  Self-taught programmer In elementary school, started programming with an Atari 800XL  In high school, won programming competition with word puzzle game In college (\u0026amp;lsquo;96), published PC video game called “Legends of Istanbul”  In 2003, got a PhD in Computer Science on neural networks 2004–15, worked as post-doctoral fellow at Emory Univ. on simulating models of biological neurons and large-scale biological data mining (e.g., SQL, neural nets, genetic algos) 2012–15, Visiting Faculty teaching at Emory Univ., Math \u0026amp;amp; CS Dept. Fall 2015–present, IT faculty at GGC with Soft Dev focus and also helped start a Data Science and Analytics major   Your turn!  Login/register on discussion and respond to the “Introductions” topic; create an inline resume  Also quickly introduce yourself now in class!\n Name Major/Year Interest/experience in programming    What\u0026amp;rsquo;s happening? Welcome Soft Dev 1 students\n Projects, working with external clients (mostly GGC faculty/students) 3 phases of project work, peer review in each with …","date":-62135596800,"description":"","objectID":"080b37ae39eb6a14aeb12b2b9b918708","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-intro/","title":"Re-introduction to Software Engineering"},{"content":"Technology Review ITEC 3870 Software Development II, Anca Doloc-Mihu and Cengiz Günay (License: CC BY-SA 4.0)\n Popular Javascript web frameworks Major players; require Node.js on the server\n Angular (Typescript) - a full framework, supported by Google React (JSX) - only a library. Invented by Facebook, but open source now Vue.JS (Javascript) - modeled by original Angular, independent and open source   Angular controlled by Google and may change, forces Typescript React needs other framework components Vue is youngest and less docs available    Non-JS web frameworks  Python  Django - Very extensive, open-source framework Flask - Minimal, light, open-source framework   C#  .Net Core - Controlled by Microsoft, but platform independent   Ruby on Rails - Open-source Ruby web framework, lost some steam recently PHP (legacy) – but good with new frameworks  Laravel - easy, video tutorials Yii - performant, but steep learning curve   Java  Java Server Faces (JSF) - Legacy Java Spring - similar to .Net, controlled by Oracle     Django comes with admin section. .Net Core: Heavily object-oriented, optional Angular for front-end. Very popular.    Mobile hybrid frameworks Hybrid: cross-platform (Android, iOS, …)\n Flutter (Dart) React Native (JSX, HTML, native) Ionic (Angular/React, HTML) – based on Cordova Xamarin (C#, XML, allows native code)   JSX is React\u0026amp;rsquo;s flavor of Javascript Xamarin requires to learn another XML    SQL Databases  No database SQLite – database in a single file, simplified MySQL/Oracle/PostGreSQL/MS SQL Server – legacy, centralized, powerful, requires server   SQL used to be standard but now one should ask if needed SQLite is local, so no centralized data need to run server    NoSQL databases Simpler, less powerful, cloud options available\n MongoDB - industry leader Firebase (Google) - easy for mobile apps Cassandra CouchDB - Good for highly distributed systems   Mongo and Firebase give small free allowance on cloud - get a database without running a …","date":-62135596800,"description":"","objectID":"054c3fe8011c5217a8f5a963018ca600","permalink":"https://soft-eng-practicum.github.io/softdev2-resources/student/chapter-tech/","title":"Technology Review"}]